# coding:utf-8
import json
import telnetlib
import re

#
# try:
#     telnetlib.Telnet('192.168.112.95', port='680', timeout=20)
# except:
#     print('connect failed')
# else:
#     print('success')


content = """
IP地址 端口 类型 地理位置 上次验证 https post
182.84.145.241 3256 高匿 江西省赣州市 电信 2分25秒前
182.84.144.104 3256 高匿 江西省赣州市 电信 2分26秒前
175.7.199.222 3256 高匿 湖南省长沙市 电信 2分32秒前
106.45.104.2 3256 高匿 宁夏银川市 电信 2分59秒前
58.220.95.42 10174 未知 江苏省扬州市 电信 3分10秒前
182.84.145.13 3256 高匿 江西省赣州市 电信 3分57秒前
106.45.104.137 3256 高匿 宁夏银川市 电信 4分30秒前
47.92.234.75 80 未知 河北省 阿里云 4分46秒前
182.84.145.36 3256 高匿 江西省赣州市 电信 5分41秒前
124.205.153.29 80 未知 北京市 鹏博士长城宽带 6分56秒前"""

